In [1]:
import pandas as pd

In [2]:
s_id = pd.Series(["01","02","03","04","05"],
                 index=["小明","小红","小杰","小丽","小华"])
s_class = pd.Series(["二班","一班","二班","三班","一班"],
                     index=["小明","小红","小杰","小丽","小华"])
s_grade = pd.Series([92,67,70,88,76],
                     index=["小明","小红","小杰","小丽","小华"])

df1 = pd.DataFrame({"学号": s_id,"班级": s_class,"成绩": s_grade})
df1

    学号  班级  成绩
小明  01  二班  92
小红  02  一班  67
小杰  03  二班  70
小丽  04  三班  88
小华  05  一班  76

In [3]:
df1.index

Index(['小明', '小红', '小杰', '小丽', '小华'], dtype='object')

In [4]:
df1.columns

Index(['学号', '班级', '成绩'], dtype='object')

In [5]:
df1.values

array([['01', '二班', 92],
       ['02', '一班', 67],
       ['03', '二班', 70],
       ['04', '三班', 88],
       ['05', '一班', 76]], dtype=object)

In [6]:
df1.T

    小明  小红  小杰  小丽  小华
学号  01  02  03  04  05
班级  二班  一班  二班  三班  一班
成绩  92  67  70  88  76

In [7]:
df1["班级"]

小明    二班
小红    一班
小杰    二班
小丽    三班
小华    一班
Name: 班级, dtype: object

In [8]:
df1.班级

小明    二班
小红    一班
小杰    二班
小丽    三班
小华    一班
Name: 班级, dtype: object

In [9]:
df1.loc["小丽"]

学号    04
班级    三班
成绩    88
Name: 小丽, dtype: object

In [10]:
df1.loc["小红":"小丽"]

    学号  班级  成绩
小红  02  一班  67
小杰  03  二班  70
小丽  04  三班  88

In [11]:
df1.loc[['小红','小丽']]

    学号  班级  成绩
小红  02  一班  67
小丽  04  三班  88

In [12]:
df1.loc['小丽','成绩']

np.int64(88)

In [13]:
df1.loc[:,"班级":"成绩"]

    班级  成绩
小明  二班  92
小红  一班  67
小杰  二班  70
小丽  三班  88
小华  一班  76

In [14]:
df1[df1["成绩"]>80]

    学号  班级  成绩
小明  01  二班  92
小丽  04  三班  88

In [15]:
df1[(df1['成绩'] > 80) & (df1['班级'] == "三班")]

    学号  班级  成绩
小丽  04  三班  88

In [16]:
df1.head(3)

    学号  班级  成绩
小明  01  二班  92
小红  02  一班  67
小杰  03  二班  70